In [1]:
import warnings
warnings.filterwarnings("ignore")

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# from sklearn import ?
# from sklearn.metrics import ?

<br>

## 1. Preparing dataset (2Î≤àÎ∂ÄÌÑ∞ Ïã§Ïäµ ÏßÑÌñâ)

In [2]:
data_df = pd.read_csv('titanic.csv')
data_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

## Data info

- **PassengerId** : Unique ID of passenger
- **Survived** : 0 = No, 1 = Yes
- **pclass** : Ticket class (1 = 1st, 2 = 2nd, 3 = 3rd)
- **sibsp** : # of siblings & spouses aboard the Titanic
- **parch** : # of parents / children aboard the Titanic
- **ticket** : Ticket number
- **cabin** : Cabin number
- **embarked** : Port of Embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)

In [3]:
y_data = data_df[['Survived']]
y_data.head(3)

   Survived
0         0
1         1
2         1

In [4]:
del data_df['Survived']
x_data = data_df.copy()
x_data.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

<br>

## 2. Feature engineering & Feature selection

#### ÏãúÎèÑÌï¥Î≥º Ïàò ÏûàÎäî Ï†ÑÎûµÎì§

- Î∂àÌïÑÏöîÌïú Ïó¥Ïù¥ÎÇò ÏòàÏ∏°Ïóê Î∞©Ìï¥Í∞Ä ÎêòÎäî Ïó¥ÏùÄ ÏïÑÏòà ÏßÄÏö∞Í∏∞ (ex. PassengerId)
- Í≤∞Ï∏°Ïπò Ï±ÑÏö∞Í∏∞ 
- TextÎ°ú ÎêòÏñ¥ÏûàÎäî Category(Factor)Îäî Ïà´ÏûêÎ°ú Î∞îÍøîÏ£ºÍ∏∞ (ex. Male/Female -> 0/1)
- Ïã§Ïàò Î≤îÏúÑÎ•º Íµ¨Í∞Ñ Î≤îÏúÑÎ°ú Î∞îÍøîÏ£ºÍ∏∞ 
- ÌïÑÏöîÌïú Í≤ΩÏö∞ Í∏∞Ï°¥ Ïó¥ÏùÑ Î∞îÌÉïÏúºÎ°ú ÏÉàÎ°úÏö¥ Ïó¥ÏùÑ Í≥ÑÏÇ∞Ìï¥ Ï∂îÍ∞ÄÌïòÍ∏∞

## ÏõêÌïòÎäî Ï†ÑÏ≤òÎ¶¨

### Plass, Sex(one-hot encoding), Age(Min-Max? Standardizatin?), Companion(SibSp+parch, Í∞ôÏùÄ Ìã∞Ïºì), Fare(Í≥†ÎØº?) Embarked(Í≥†ÎØº??)

In [10]:
x_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Pclass       891 non-null    int64
 2   Name         891 non-null    object
 3   Sex          891 non-null    uint8
 4   Age          891 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(4), uint8(1)
memory usage: 70.6+ KB

In [11]:
x_data['Embarked']

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

## [AGE]Ïó¥ Í≤∞Ï∏°Ïπò -> Ï§ëÏïôÍ∞í
---

In [7]:
# Í∏∞Î≥∏Ï†ÅÏù∏ Í≤∞Ï∏°Ïπò Ï±ÑÏö∞Îäî Î∞©Î≤ï
mean_age = x_data['Age'].median(skipna=True)
x_data['Age'] = x_data['Age'].fillna(mean_age) # or .fillna(int/float/str Í∞í)

## ['Sex']Ïó¥ One-hot encoding

In [14]:
x_data['Sex'] = pd.get_dummies(x_data['Sex']) # ÎÇ®Ïûê 0, Ïó¨Ïûê 1

üìå Î∞∞Ïö∞Ïûê ÌòïÏ†úÎûë Í∞ôÏù¥ ÏûàÏúºÎ©¥ Í∞ôÏù¥ ÌÉàÏ∂ú Í∞ÄÎä•ÏÑ± ÎÜíÏïÑÏßàÏàòÎèÑ?, Î∂ÄÎ™®ÏûêÏãùÏù¥Î©¥ ÎäêÎ†§Ïßà ÏàòÎèÑ? 

## ['Companion'] Ïó¥ ÎßåÎì§Í∏∞
['SibSp'] Î∞∞Ïö∞Ïûê, ÌòïÏ†ú + ['Parch'] Î∂ÄÎ™® ÏûêÏãù  
['Ticket'] Ï§ëÎ≥µÏãú ÏπúÍµ¨?? ÏùºÌñâ Í∞ÄÎä•ÏÑ±?

In [16]:
x_data['Companion'] = x_data['SibSp'] + x_data['Parch']
del x_data['SibSp']
del x_data['Parch']

In [23]:
x_data.duplicated('Ticket')

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Length: 891, dtype: bool

## ÌïÑÏöîÌïú Ïó¥Îßå ÎΩëÏïÑÎÇ¥Îäî Í≥ºÏ†ï

In [22]:
x_data[['Pclass', 'Sex', 'Age',  ]]

,PassengerId,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Companion
0,1,3,"Braund, Mr. Owen Harris",0,22.0,A/5 21171,7.2500,NaN,S,1
1,2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,38.0,PC 17599,71.2833,C85,C,1
2,3,3,"Heikkinen, Miss. Laina",1,26.0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,35.0,113803,53.1000,C123,S,1
4,5,3,"Allen, Mr. William Henry",0,35.0,373450,8.0500,NaN,S,0
...,...,...,...,...,...,...,...,...,...,...
886,887,2,"Montvila, Rev. Juozas",0,27.0,211536,13.0000,NaN,S,0
887,888,1,"Graham, Miss. Margaret Edith",1,19.0,112053,30.0000,B42,S,0
888,889,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,28.0,W./C. 6607,23.4500,NaN,S,3
889,890,1,"Behr, Mr. Karl Howell",0,26.0,111369,30.0000,C148,C,0
890,891,3,"Dooley, Mr. Patrick",0,32.0,370376,7.7500,NaN,Q,0

<br>

## 2. Train - Test split (ÎπÑÏú®ÏùÑ 7:3 ÏúºÎ°ú Ïú†ÏßÄÌï¥Ï£ºÏãúÍ≥†, seedÎäî 0ÏùÑ Ï†ÅÏö©Ìï¥Ï£ºÏÑ∏Ïöî)

In [19]:
from sklearn import model_selection

In [ ]:
x_train, x_test, y_train, y_test = model_selection.train_test_split()

<br>

## 3. Create model instance variable (ÎèôÏãúÏóê Ïó¨Îü¨ Î™®Îç∏ÏùÑ Îã§Î•∏ Ïù¥Î¶ÑÏúºÎ°ú ÎßåÎì§ Ïàò ÏûàÏäµÎãàÎã§.)

<br>

## 4. Train the model

<br>

## 5. Predict on test data & Check the result with metrics (Î™®Îç∏ Í∞Ñ ÎπÑÍµêÍ∞Ä Í∞ÄÎä•Ìï©ÎãàÎã§.)